#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье': [
        {'shop': 'ашан', 'price': 10.99},
        {'shop': 'пятерочка', 'price': 9.99},
    ],
    'карамель': [
        {'shop': 'ашан', 'price': 45.99},
        {'shop': 'магнит', 'price': 41.99},
    ],
}
# Указать надо только по 2 магазина с минимальными ценами
print("Печенье в магазине", sweets['печенье'][0]['shop'], "стоят", sweets['печенье'][0]['price'], "руб.")
print("Печенье в магазине", sweets['печенье'][1]['shop'], "стоят", sweets['печенье'][1]['price'], "руб.")
print("Карамель в магазине", sweets['карамель'][0]['shop'], "стоят", sweets['карамель'][0]['price'], "руб.")
print("Карамель в магазине", sweets['карамель'][1]['shop'], "стоят", sweets['карамель'][1]['price'], "руб.")